{
  "format": "tfjs-layers-model",
  "generatedBy": "emergency-fallback",
  "error": "'LandscapeClassifier' object has no attribute 'plot_training_history'",
  "timestamp": "2025-04-09 16:00:31",
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": []
    }
  ]
}